*&---------------------------------------------------------------------*
*&  Include           ZEDR07_088_PBO
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  STATUS_0102  OUTPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE STATUS_0102 OUTPUT.
  SET PF-STATUS 'STATUS_0102'.
  SET TITLEBAR 'T102'.
ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  SET_ALV  OUTPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE SET_ALV OUTPUT.

  "IF문을 추가해서 사용자 입력시마다 이 모든 ALV 설정과 관련된 함수들을 불러오는 것이 아니라
  "처음 한번만 불러오게 변경함
  IF GC_DOCKING IS INITIAL.
    PERFORM CREATE_OBJECT. "여기서 객체 생성
    PERFORM FIELD_CATALOG. "필드 카달로그
    PERFORM ALV_LAYOUT. "레이아웃 설정
    PERFORM ALV_SORT. "정렬
    PERFORM ALV_DISPLAY. "ALV 출력을 위해 메서드 부르는 곳
  ELSE.
     "REFRESH 기능 추가
    PERFORM REFRESH.
  ENDIF.
ENDMODULE.
